Repository: mozilla-l10n/mt-training-data
Catalog: cjk/cjk_pontoon.tmx
Source language: en_us
Languages: cjk

source: 1 sentence collected
cjk: 1 Kumbata isoneko

source: 2 down, keep it up!<playIcon></playIcon>
cjk: Kuhiana <playIcon></playIcon>, yali !

source: About
cjk: Hakuthwala

source: Accepted file types: .tsv only
cjk: Cheseko fichier chakutaiza : .tvs chene

source: { $actionType }<playIcon></playIcon> did they accurately speak the sentence?
cjk: { $actionType }<playIcon></playIcon>badjika isoneko yatela kuchadjika ?

source: { $actionType }<recordIcon></recordIcon> then read the sentence aloud
cjk: { $actionType }<recordIcon></recordIcon>nawa etsha chisoneko cha liji lia helu.

source: { $actionType }<stopIcon></stopIcon> when done
cjk: { $actionType }<stopIcon></stopIcon>nyi wa huisa

source: { $actionType } submit when ready
cjk: { $actionType } thuma shimbu mulisalila

source: Add and Review Sentences, Add Questions, Transcribe Audio
cjk: Wezela isoneko hinabalika, wezela ihulo, transcription audio

source: Add <icon></icon> a public domain sentence
cjk: Wezela<icon></icon> isoneko kusali ya mbunga

source: Add information
cjk: wezela ihadjeka

source: Add new sentences for the community to read
cjk: Wezela yaha ya isoneko ya kutanga ya muli mbunga

source: Add one sentence per line
cjk: Wezela chisoneko hamufundo

source: Add questions in your language
cjk: Wezela ihulo ya mulimi lienu

source: Add Sentences
cjk: Wezela isoneko

source: Add sentences in your language
cjk: Wezela isoneko ya mulimi lienu

source: Add up to 1,000 sentences
cjk: Wezela isoneko ndo ha 1000

source: Add Your Voice
cjk: Nehenu mumu wa majili

source: Agriculture and Food
cjk: kulima nyi kupita chakulia

source: All sentence must have the same domain
cjk: Isoneko yeswe inatamba kubwa domain imuwika

source: All sentences must have the same citation
cjk: Isoneko yeswe inatamba citation imuwika

source: Already have an account? <login>Log-In</login>
cjk: Nuli nawa nyi chipawa ? <login>Kuwana</login>

source: An error occurred fetching sentences
cjk: Ulema wezanga shimbu lia kumbata isoneko

source: An error occurred reviewing this sentence
cjk: Ulema wabwanga wasolokanga shimbu lia kutla tshisoneko

source: An error occurred submitting your voice information
cjk: Tshilema cha kathukanga shimbu lia kuthuma ihandjeka

source: Approve
cjk: Shindakenyo

source: A quiet background hubbub is OK, but we don’t want additional voices that may cause a machine algorithm to identify words that are not in the written text. If you can hear distinct words apart from those of the text, the clip should be rejected. Typically this happens where the TV has been left on, or where there is a conversation going on nearby.
cjk: Kuzeya cha zungo lia hashi kali taiza, alioze lia telele kupwa ni liji lia kuwezela muli tela kuneha algorithme machine hakwambulula kuliji lize lishiko muchisoneko. Nyi munuhasa kwiva isoneko ya kulisasa ya ize ya kwandjika, kundjisa chinatela kumbila. Acho chakusolwesa chindji nyi television ka ihitshi kanga ya kukwachisa chipwe handji muhandjekelo wapwanga nyi fashi ya kusongo.

source: Are you coming? <strong>[called by another]</strong>
cjk: Uneza ? <strong>[ka litongola nyi liji likwo]</strong>

source: Ask us questions on <matrixLink>Matrix</matrixLink>, <discourseLink>Discourse</discourseLink> or <emailLink>email</emailLink>.
cjk: lihulenu yahulo ya <matrixLink>Matrix </matrixLink>, <discourseLink>Discourse</discourseLink> ou <emailLink>email</emailLink>.

source: Automotive and Transport
cjk: motoka ni kumbata

source: Background Noise
cjk: Zungu lia kusongo

source: Background Voices
cjk: Liji lia kunyima lia kulu

source: Be cautious before rejecting a clip on the ground that the reader has mispronounced a word, has put the stress in the wrong place, or has apparently ignored a question mark. There are a wide variety of pronunciations in use around the world, some of which you may not have heard in your local community. Please provide a margin of appreciation for those who may speak differently from you.
cjk: Lihwimikize ola kanda uchimbila chilweza chendja mumu wa kutanga kanafupa kuwana upi wakutongola liji limuika chipwe amwe ma voyelles, kana fupa kuli chiza hachi hulo. Kwatwama unene wa kuchendja uhadjikilo wa kutumikisa mu tshifutshi, muze amwe ngwe yenu kanda kama atshiva mu ndonda yenu. Nguna nwita kululieka kunyingika mumu wathu waze matela kuhandjika kulisa nyiyenu.

source: [‘Beret’ is OK whether with stress on the first syllable (UK) or the second (US)]
cjk: [Muhandjikilo wa « ivuvu » uli wa umwenemwene gwe chize nunevu « Vango » (FR) handji « ouagon » (BE)]

source: <bold>{ $count }</bold> Clips
cjk: Ipindji

source: <bold>Help us</bold> find more voices
cjk: <bold>Tukwasenuko </bold> kuwana maliji ha

source: Bulk batch
cjk: Unene wundji

source: Bulk Sentences Uploaded
cjk: Isoneko chakuthuwa

source: By telling us about yourself, you will help developers build more inclusive technology
cjk: Wakuzangila nawa kukwaha yihadjeka ikwo helu lia mulali wa kuhadjika ?

source: By using Common Voice, you agree to our <termsLink>Terms</termsLink> and <privacyLink>Privacy Notice</privacyLink>
cjk: Kulingila jila ya Common Voice, kutaiza <termsLink>shimbi yakulingila mfefe jethu</termsLink> na yethu <privacyLink>akuswamana</privacyLink>

source: Cancel Re-recording
cjk: Jima ya kukwachiwa

source: Cancel Submission
cjk: Kujima kuthuma

source: Cannot submit more than 1000 sentences
cjk: Hitchashiko kulisunwisa kuhiana cha 1000 wa isoneko

source: Change preferences
cjk: Chenja kuzanga chami

source: Check <icon></icon> is this a linguistically correct sentence?
cjk: Hengula <icon></icon> isoneko inalita mu cheseko cha malimi

source: <chevron></chevron>See less
cjk: <chevron></chevron> Solola imwe ikwo ikehe

source: <chevron></chevron>See more
cjk: <chevron></chevron>Solola imwe ikwo

source: Citation
cjk: Kuhwa cha

source: Cite with a URL link or the full name of the work.
cjk: Tongola mukusa kulinunga cha jina lieswe.

source: Click
cjk: Shindakenya ha

source: Clips Uploaded
cjk: sako mu jila

source: Comment
cjk: Kuwezela

source: Contact Form
cjk: Ulwezano wa kulisanyika

source: Contact Us
cjk: Tusanyike

source: Continue
cjk: Kuya lume

source: Continue validating
cjk: Linga cha kutaiza

source: Contribute
cjk: Kuchingilako

source: Contribute sentences
cjk: Nehenu isoneko ikwo

source: Contribution Criteria
cjk: Ili tshize chakuhana

source: Create a profile
cjk: Kulinga

source: Criteria
cjk: Chize chatamba kupwa

source: Datasets
cjk: Hiheho ya yuma

source: Delete my recordings
cjk: Kujima ya kukwata

source: Different language
cjk: Limi likwo

source: Difficult to pronounce
cjk: Yikalu kutongola

source: Discard ongoing recording
cjk: Kukatala kundjisa mutshipidji

source: Does the sentence meet the guidelines?
cjk: Chisoneko mutshibwa cha kulita ku inyingi ?

source: Donate your voice
cjk: Hana hakehe liji lie

source: Don't see your language on Common Voice yet?
cjk: Limi lieye kanda lichipwako ?

source: Drag your file here or <uploadButton>click to upload</uploadButton>
cjk: linga kusa chakulita cha fichier aha chipwe <uploadButton> chata mumu wa kuthuma</uploadButton>

source: Drop file here to upload
cjk: Sako fichier hano mulonga wa kuthuma

source: Enter your email
cjk: Kwandjika utwamino wenu

source: Enter your public domain sentence here
cjk: Soneka chisoneko cheye cha chihanda cha mbunga ahano

source: Enter your public domain sentences here
cjk: Soneka chisoneko cheye cha chihanda cha mbunga ahano

source: Error adding sentence
cjk: Uhenge ola ya kuwezela isoneko

source: ESC
cjk: Kwehuka

source: Exit & Delete clips
cjk: Kathuka mawa Jima yeswe ya kukwata

source: Fewer than 15 words per sentence
cjk: Mwishi lia 15 maliji

source: File is too large
cjk: Fichier chili chinene lia kulu

source: File is too small
cjk: Fichier chili chikehe chindji

source: Finance
cjk: mbongo

source: Finish recording
cjk: Kwisa ya kukwata

source: Finish recording first?
cjk: Likulu hurisa kukwata !

source: Finish Review
cjk: Wisa kuhengula

source: Finish validating
cjk: Kuhuza cha kutaiza

source: Finish validating clips?
cjk: Hwisa kusolola cha inyingi ?

source: Follow guidelines from “What sentences can I add?”
cjk: Kaulenu jila ikwo « isoneko ika ize mungu wezela ? »

source: for example
cjk: Kwesekesa

source: For technology to work well for everyone, the data that helps developers to build technology needs to reflect a diverse range of people. For example, if we don't include any speakers with a particular accent, then the technology won't work well for people with that accent. <learnMore>Learn more about why metadata matters.</learnMore>
cjk: Ngwe unyikigiko wa welo lia kulu unathumika kanawa mulonga wa ko ifuchi ya muze inakwsa kutwa la kulutwe kuthunga cha helu cha unyingikiso muso lola usuku unene wa athu. Chishimo nyi twasele nyi chiwe mukwa kubandji ka nyi kukhakhamisa alioze unyingikiso wa helu ushiku thumika ku ubeme wa athu nyi kukhakhamisa. <learnMore>Ku nyingika cha helu cha ulemu</learnMore>

source: General
cjk: mu undji

source: General language / multiple variants
cjk: undji helu ya limi / undji ya wakuchendja

source: Grammatical / spelling error
cjk: Ulema wa kutanga / ulema wa kusoneka

source: Great!<recordIcon></recordIcon> Record your next clip
cjk: y kukomokesa !<recordIcon></recordIcon> Kwata mawa chipidji,

source: Great work!<playIcon></playIcon> Listen again when you're ready
cjk: Mulimo ubema ! <playIcon></playIcon> Badjika mawa shimbu

source: Guidelines
cjk: Inyingi

source: Healthcare
cjk: ungunu

source: Help create Common Voice’s first target segment in { $locale }
cjk: Kwasenu hakuputhuka chitangu kutondekeza cha Common Voice ha { $locale }

source: Help us build a community around voice technology, stay in touch via email.
cjk: Tukwasenu kukungulula mbunga kusango jakuhadjeka, tuliwanenu hamuwika via e-mail

source: Help us validate voices
cjk: Tukwasenuko Kunyingikisa yinyingi ya maliji

source: His hand was rais-ed.
cjk: Sandwitch moyo ma nteka

source: History, Law and Government
cjk: ishima, shimbi nyi nguvulu

source: How do I cite?
cjk: Kuchi kulinga kuhwa cha ?

source: How to add multiple sentences
cjk: Kuchi muwezela unji wa isoneko

source: How would you describe your sex or gender?
cjk: Kuchi mwanzanga kwambulula chinyingi cha ulunga nyi cha uthu ?

source: I agree
cjk: Nataiza

source: I confirm that these sentence are <wikipediaLink>public domain</wikipediaLink> and I have permission to upload them.
cjk: Ngonanulweza nyi shindakenyo isoneko ili <wikipediaLink> yihanda ya mbunga </wikipediaLink> athu nawa nguli nyi ululi wa kuthuma isoneko.

source: I confirm that this sentence is <wikipediaLink>public domain</wikipediaLink> and I have permission to upload it.
cjk: Nguna handjika nyi shinda kenyo chisoneko chili <wikipediaLink> chihanda cha mbunga</wikipediaLink> nyi nabwa nyi shimbi lia kuthuma.

source: <icon></icon> Add multiple public domain sentences
cjk: <icon></icon> Wezela undji wa isoneko ya ihanda ya mbunga ya athu

source: Ideally natural and conversational (it should be easy to read the sentence)
cjk: Chisoneko chatamba kubwa cha kuntanga kuli zambi nyi kuhandjika (mwitamba kubwa yashi kutanga)

source: I do not agree
cjk: Chisolo

source: If it’s your own words, just say <italicizedText>“Self Citation”</italicizedText>. We need to know where you found this content so that we can check it is in the public domain and no copyright restrictions apply. For more information about citation see our <guidelinesLink>Guidelines page</guidelinesLink>.
cjk: Nyi ili isoneko ya maliji jenu, soneka lume <italicizedText> « auto-citation » </italicizedText>. Thuli nyi pweila ya kunyingikakuze anejila ize ili hamuwikha kuhwa nyi uhashi wa kuhengula nyi kali mu (domain) mbunga nyi kushi kwecha ulemu wa mukwa kusoneka. Mumu wamijimbu ya citation, talenu <guidelinesLink>inyingi yetu </guidelinesLink>.

source: If the recording breaks up, or has crackles, reject unless the entirety of the text can still be heard.
cjk: Nyi kukwata muchibwa cha kulihicheka chipwe cha kuli tete teta, chimbile handji undji wa isoneko kanda upwa ni mana.

source: If there is additional information you want to provide about this file, please contact <emailFragment>commonvoice@mozilla.com</emailFragment>
cjk: Nyi mu zanga kukwasa ku mijimbu ya maliji welo wa chihela watela kusanyika fichier, nuna tamba kusanyika<emailFragment>commonvoice@mozilla.com</emailFragment>

source: If there is additional information you want to provide about this file that is not included in the template, please contact <emailFragment>commonvoice@mozilla.com</emailFragment>
cjk: Nyi mu zanga kuneha ihandjeka ya maliji welo wa chihela watela kusanyika fichier, yishi yakusa mulali, nua tamba kusanyika <emailFragment>commonvoice@mozilla.com</emailFragment>

source: If the sentence does not meet the above criteria, click the &quot;Reject&quot; button on the left. If you are unsure about the sentence, you may also skip it and move on to the next one.
cjk: Nyi tshisoneko cha kukumbula kuchize tshili lamba helu lia « lutobe » ku umama.

source: If the sentence meets the criteria, click the &quot;Approve&quot; button on the right.
cjk: Nyi tshisoneko cha kukumbula kuchize tshili lamba helu lia « lutobe » ku utata.

source: If you come across something that these guidelines don’t cover, please vote according to your best judgement. If you really can’t decide, use the skip button and go on to the next recording.
cjk: Nyi nwa wana umwe mulonga aji shimbi kanda jifupa, nguna nwita kuchakula hakutwala kusanyika hasali lipema. Nyi wahashile chochene kukasa, tumikisa bouton « balika » nawa palika ha kundjisa chikwo.

source: If you run out of sentences to review, please help us collect more sentences!
cjk: Nyi nuabwa nyi kukhakhajana muatambile hamuwikha kuthumbuka kuhiana hachize muchinga !

source: Include appropriate citation
cjk: Kuhwacha kubwanacho chinatamba kubwa kusa

source: Invalid file
cjk: Fichier kha Sako songo

source: It contains words or phrases that are hard to read or pronounce.
cjk: Majina akwo chibwe ihandjika ili ikalu kutanga chibwe kuhadjika.

source: It is written in a language different than what I’m reviewing.
cjk: Chisoneko cha kwadjika mu limi lia kulisasa ku lize hingumatanga.

source: It is written in a language different than what I’m speaking.
cjk: Isoneko yakusoneka mulimi linalisa nyi lisena kuhandjika.

source: Just Unsure?
cjk: Una khakhajala?

source: Keep it up, record again <recordIcon></recordIcon>
cjk: Yako mawa kwata lia kulu.

source: Keep the recordings
cjk: Kulama yize ya kukwata

source: Keep track of your progress with a profile
cjk: Pima kwendeleya che hakuputuka jila

source: Language
cjk: Limi

source: Language Fundamentals (e.g. Digits, Letters, Money)
cjk: chize cha tela malimi (chiffres, sona, mbongo)

source: Language Request
cjk: Kutonda Limi

source: Language request successfully submitted, thank you.
cjk: Limi lia bwanga kutonda, wakalakala

source: Languages
cjk: Ma limi

source: Large bulk sentence submission
cjk: Thuma isoneko yindji

source: Learn More
cjk: Hakunyingika chinji

source: Leaving now means you'll lose your progress
cjk: Kathuka haliabwila mulinga kutokesa cha kuya

source: Listen
cjk: Badjika

source: Listen options menu
cjk: Tshihanda « badjika »

source: Loading sentences…
cjk: Wezela isoneko…

source: <loginLink>Login</loginLink> or <loginLink>sign up</loginLink> to add multiple sentences
cjk: <loginLink>Musenuko </loginLink>chibwe <loginLink> lisonekesenu </loginLink> mumu wakuwezela isoneko indji

source: Log in or sign up to get started
cjk: Liwanenu chipwe Liadjikisenu mumu wa wakuputhuka

source: Log In / Sign Up
cjk: Kuliwezela / Kuliadjikisa

source: Make sure the sentence meets the following criteria:
cjk: Nyingikenu chisoneko muchikumbulula chize chimatamba kubwa :

source: Maximum file size: 25 MB
cjk: Chiphimo cha fircher : 25 Mo

source: Media and Entertainment
cjk: uhandjikilo nyi kuliswelesa

source: Message
cjk: Mujimbu

source: Minimum sentences in file: 1000
cjk: Undji wa isoneko muchi hela cha fichier : 1 000

source: [Mismatched content]
cjk: [Udji wa mijimbu]

source: Misreadings
cjk: Hupi wa kutanga

source: Missing an <strong>'s'</strong> at the end of a word.
cjk: Kahona <strong>« s »</strong> chimuwikha kusongo.

source: Missing <strong>'A'</strong> or <strong>'The'</strong> at the beginning of the recording.
cjk: Kahona <strong>« hauze » </strong> muhuputukilo wa kukwata.

source: Missing the end of the last word by cutting off the recording too quickly.
cjk: Kusongo lia isoneko ikwo ya kuteta, kuyikwata kumana cha fuji fuji.

source: [More has been recorded than the required text]
cjk: [Kulutwe lia isoneko ize hana kwata]

source: Most recordings are of people talking in their natural voice. You can accept the occasional non-standard recording that is shouted, whispered, or obviously delivered in a ‘dramatic’ voice. Please reject sung recordings and those using a computer-synthesized voice.
cjk: Munuhasa kutaiza shimbu likhwo kundjisa chakeshi kuhandjeka hashi chipwe cha washi kutongola nyi liji limuwika « maheho theatre ». Nunatamba kumbila kundjisa kwimba nawa waze akutumikisa liji limuwika kuteta kuli machinyi

source: Name
cjk: Jina

source: Nature and Environment
cjk: Hashi nyi wautwamino

source: News and Current Affairs
cjk: Yaha

source: No
cjk: Kha

source: [No ‘a’ in the original text]
cjk: [Kushi « y » mu isoneko ya ma jina ya mwenemwene]

source: <noCopyright>No copyright</noCopyright> restrictions (cc-0)
cjk: <noCopyright>Kushi uhashi wa shimbu lia mukwa kusoneka</noCopyright>(cc)

source: No foreign letters
cjk: Kushi chisoneko cha ungeji

source: No microphone found.
cjk: Kushi chihondo cha kunana

source: No numbers and special characters
cjk: Kushi chiffres chibwe yako yinatela

source: No sentences to review. <addLink>Add more sentences now!</addLink>
cjk: Kushi shisoneko chaku hengula. Munu wezele <addLink>kuhiana isoneko</addLink>.

source: No Thanks
cjk: Kha kusakwila

source: No thanks, continue speaking
cjk: kha kukalakalisa, yenu lume hadjika

source: Offensive language
cjk: Maliji anene

source: Offensive speech
cjk: Maliji akulemeka

source: On desktop devices you can contribute by downloading…
cjk: Kuyitangililo ya zuo lia mulimo mwatamba kukwata cha haa

source: On his head he wore a beret.
cjk: Kumbuyi kana koka ivuvu indji.

source: On iOS please continue with Safari to enable recording…
cjk: Mwishi iOS, nunatamba kuyalume nyi safari mumu wakulinga kukwata …

source: On the other hand, if you think that the reader has probably never come across the word before, and is simply making an incorrect guess at the pronunciation, please reject. If you are unsure, use the skip button.
cjk: Hachize, nyi munu nyonga ngo akwakutanga malunga chibwe mapwo kanda awana majina ahakulu apime nawa mumu apwe nimu tongwelo upwema, nguna nwita kumbila kundjisa. Kukhakhajana, tumikisa bouton wakupalika.

source: Other Language
cjk: Limi likwo

source: Partner
cjk: Kulikunda

source: [Part of the text can’t be heard]
cjk: [Chihanda cha isoneko chatambile kwivakana]

source: <playIcon></playIcon>Last one!
cjk: <playIcon></playIcon> Kali wa kusongo !

source: Play/Stop
cjk: Kutanga / kumana

source: Please check our <templateFileLink>template file</templateFileLink>. Your sentences should be copyright free (CC0 or permissioned original work by the submitter) and be clear, grammatically correct and easy to read. Submitted sentences should take roughly 10-15 seconds to read and should avoid including numbers, proper nouns and special characters.
cjk: Nuna tela kulwezana <templateFileLink>muchili </templateFileLink> wetu. isoneko ya tela kubwa washi chibwe (CC0 mulimo wa ka shishi) uze mukwa kusoneka kahandjika hatoma kusoneka cha kashishi nawa chashi kutanga. Isoneko yakuthuma muyibwa ya shimbu 10-15 ya chipindji cha kutanga cha kusa.

source: Please fill out this field.
cjk: Nunatela kuzalisa munda.

source: Please select a language to review sentences.
cjk: Munatambe kwezela limi mulonga wa kuhengula isoneko.

source: r
cjk: e

source: [‘Raised’ in English is always pronounced as one syllable, not two]
cjk: [« Sandwich » mulimi lia ungeji kanalitongola ngwe sona, hi yali ko]

source: Rate limit exceeded. Try again in { $retryLimit } minutes
cjk: Ngiza ya kuhiana. nwatela kweseka mu { $retryLimit } shimbu

source: Rate limit exceeded. Try again in { $retryLimit } seconds
cjk: Ngiza ya kuhiana. nwatela kweseka mu { $retryLimit } second

source: Reader Effects
cjk: Ola indji ya kutwata athu kakuhandjika nyi maliji jo.

source: Reading contractions that aren't actually there, such as "We're" instead of "We are", or vice versa.
cjk: Kwecha cha kuliwana cha keshi kubwako, kanatshitanga « chochene » achihela cha « chochene ».

source: Read Sentences
cjk: tanga isoneko

source: Read Sentences, Answer Questions
cjk: tanga isoneko kumbulula kuyihulo

source: Read Sentences <small>(Coming soon)</small>
cjk: tanga isoneko <small>(tangwa mulizaho)</small>

source: Read sentences submitted by the community in various languages
cjk: Tanga isoneko inalita nyi chikungulwila mukuli hicheka cha ma limu

source: Ready to do { $count } more?
cjk: Kawashi kulinga yinji { $count }nawa?

source: <recordIcon></recordIcon> Last one!
cjk: <recordIcon></recordIcon> wakusongo !

source: [Recording cut off before the end of the last word]
cjk: [Kukwata cha kuteta kulutwe lia songo lia nyima lia isoneko ya majina]

source: Record/Stop
cjk: Kukwata/kumika

source: Record yourself reading sentences in your language
cjk: Kwata yoze umatanga isoneko mu kachi ka limi lie

source: Record yourself responding to questions and prompts in your language
cjk: Lisonekese shimbu unakumbulula ku yihulo kuli waze watambikanga mu limi lienu

source: Record your voice
cjk: Kwata liji lie

source: Reference the source of your sentence (required)
cjk: Solwesa kasulo cha isoneko yeye (Chatela)

source: Reject
cjk: Kumbila

source: Report
cjk: Kutoweza

source: Report was passed successfully
cjk: Mujimbu kautuma hakeshi kampalia

source: Request a Language
cjk: Kuchakula limi

source: *required
cjk: Ize inatela

source: Re-record
cjk: Kukwachiwa cha

source: Re-record clip
cjk: Kuhilukila kukwata

source: Return
cjk: Kundjila

source: Return to Common Voice Datasets
cjk: Kuhilukila ku maheho Common voice

source: Review
cjk: Kuhengulula

source: Review could not be saved. Please try again later.
cjk: Kuhengula chatambile kubwa cha kukwata.

source: ⓘ Review Criteria
cjk: Chize tshili cha kuhilukila

source: Review Criteria
cjk: Chize tshili cha kuhilukila

source: Reviewed sentences not submitted, are sure?
cjk: Isoneko ya kuhengula ishi kubwa ya kukuthuma munuzanga kubuthuka ?

source: Review existing sentences submitted by the community
cjk: Hengula isoneko ya thwama ize mbunga ana neha

source: Review & re-record clips here as you go
cjk: Hengula mawa kwata purila

source: Review & re-record clips if needed
cjk: Hengula ma kwata mawa nyi muchi hashiwa

source: Review Sentences
cjk: Hengula isoneko

source: Review sentences in your language
cjk: Hengula isoneko ya mulimi lienu

source: Review & Submit
cjk: Hengula nawa thuma

source: Review transcriptions of recorded sentences for accuracy
cjk: Hengula umwenemwene wa isoneko ya kukwata

source: Review user-submitted transcriptions in your language
cjk: Hengula isoneko inatala akwa intangililo malungu mapw mu limi lio.

source: s
cjk: a

source: S
cjk: P

source: Select a Language...
cjk: Kuchinga Limi…

source: Select an option
cjk: Tondemu chimwe

source: Select a variant (optional)
cjk: kuchinga ize yaku chenja (facultatif)

source: Select File
cjk: Tongola fichier umuwikha

source: Select File to Upload
cjk: Tongola fichier ya kuthuma

source: Select up to three domains (optional)
cjk: Chingenu ndo ku yihanda itathu
